src/app/controllers/competitors_controller.rb

SELECT "competitors".* FROM "competitors"
---
  def index
    @competitors = Competitor.all

INSERT INTO "competitors" ("imageurl", "latitude", "longitude", "price", "source", "title", "update_at", "url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create

    #client = Elasticsearch::Client.new host: "http://#{ENV['ES_HOST']}:9200"
    client = Elasticsearch::Client.new host: "http://192.168.100.6:9200"
    product_name = competitor_params[:title]
    query =  { "_source": ["title", "price","store_id","product_id","store_name","imageurl","size","url","updated_at","status","currency"], "query":{ "match":{ "title":{"query":product_name} } } }
    es_response =client.search index: 'honestbee', body: query
    #Array
    @data = es_response['hits']['hits'].map { |r| r['_source']}

    @competitor_price = Competitor.new(competitor_params)
    if @competitor_price.save

SELECT  "competitors".* FROM "competitors" WHERE "competitors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_competitor
      @competitor = Competitor.find(params[:id])