src/app/controllers/competitor_prices_controller.rb

  def index
    @competitor_prices = CompetitorPrice.all
---
SELECT "competitor_prices".* FROM "competitor_prices"

  def create

    client = Elasticsearch::Client.new host: 'http://192.168.2.125:9200'
    client.search index: 'honestbee', body: {"query":{"match":{"title":{"query":"牛排"}}}} -H 'Content-Type: application/json'



    respond_to do |format|
      if @competitor_price.save
---
INSERT INTO "competitor_prices" ("imageurl", "price", "source", "title", "update_at", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    @competitor_price.destroy
---
DELETE FROM "competitor_prices" WHERE "competitor_prices"."id" = $1  [["id", 1]]

    def set_competitor_price
      @competitor_price = CompetitorPrice.find(params[:id])
---
SELECT  "competitor_prices".* FROM "competitor_prices" WHERE "competitor_prices"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]