src/app/controllers/searchterms_controller.rb

  def index
    @searchterms = Searchterm.all
---
SELECT "searchterms".* FROM "searchterms"